*
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
*
ENVIRONMENT DIVISION.
*
DATA DIVISION.
*
PROCEDURE DIVISION.
MAIN.
	DISPLAY "HELLO,WORLD"
	STOP RUN.

