*見出し
IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-02.
*環境部
ENVIRONMENT DIVISION.
*データ部
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(5).
01 NUMS PIC 9(2).
*手続き部
PROCEDURE DIVISION.
MAIN.
	MOVE 25600 TO NUM
	DISPLAY "NUM is " NUM

*これ自体はエラーではなく下2桁 51が出力される。
	MOVE 151 TO NUMS
	DISPLAY "NUMS is " NUMS
	STOP RUN.

