*
IDENTIFICATION	DIVISION.
PROGRAM-ID.		WORDCONST-03.
*
ENVIRONMENT		DIVISION.
*
DATA			DIVISION.
WORKING-STORAGE	SECTION.
01 WK-STRING	PIC X(5).
01 WK-NUMBER	PIC 9(10).
*
PROCEDURE DIVISION.
MAIN.

	MOVE "ABCDE"	TO WK-STRING.
	DISPLAY "WK-STRING IS " WK-STRING.

	MOVE ZERO		TO WK-NUMBER.
	DISPLAY "WK-NUMBER IS " WK-NUMBER.

	STOP RUN.