*
IDENTIFICATION	DIVISION.
PROGRAM-ID.		VALUE-01.
*
ENVIRONMENT		DIVISION.
*
DATA			DIVISION.
WORKING-STORAGE	SECTION.
01 A PIC 9 VALUE 3.
01 B PIC 9 VALUE 2.
01 C PIC ZZ9.
*
PROCEDURE 		DIVISION.
MAIN.
	COMPUTE C = A ** B
	DISPLAY C
	STOP RUN.
